app/views/public/products/index.html.erb

SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"
---
<!--商品一覧を表示する-->
          <p>商品一覧(全<%= Product.count %>件)</p>