app/controllers/public/members/sessions_controller.rb

  def reject_customer
    @member = Member.find_by(email: params[:member][:email].downcase)
---
SELECT  "members".* FROM "members" WHERE "members"."email" = ? LIMIT ?  [["email", "test@test"], ["LIMIT", 1]]