app/views/public/recipes/_recipe.html.erb

<div class="recipe-index">
  <p>レシピ一覧(全<%= Recipe.count %>件)</p>
---
SELECT "recipes".* FROM "recipes"
SELECT COUNT(*) FROM "recipes" WHERE (title LIKE '%コンビーフ%')