app/views/public/recipes/show.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]
---
                  <div class="average-score-display ml-3 pt-2">
                    <%= @recipe.avg_score %>点 （<%= @recipe.reviews.count %>件のレビュー）