app/controllers/admin/members_controller.rb

  def index
    # @members = Member.all
    @members = Member.page(params[:page]).per(5)
---
SELECT "members".* FROM "members"

  def update
    @member = Member.find(params[:id])
    if @member.update(member_params)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "is_deleted" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["is_deleted", 0], ["updated_at", "2021-08-09 08:17:25.890353"], ["id", 1]]