app/controllers/admin/products_controller.rb

INSERT INTO "products" ("name", "image_id", "introduction", "kodawari", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @products = Product.all
    @product = Product.new(product_params)
    if @product.save

SELECT "products".* FROM "products"
---
  def index
    # @products = Product.all
    @products = Product.page(params[:page]).per(4)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_id", "2dc8fc23396b3975238010c758dde6ca303f518c47d07557be34f327158e"], ["introduction", "テスト投稿編集可能"], ["updated_at", "2021-08-09 12:07:07.826327"], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)