app/controllers/public/favorites_controller.rb

  def create
    recipe = Recipe.find(params[:recipe_id])
    favorite = current_member.favorites.new(recipe_id: recipe.id)
    favorite.save
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("member_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["member_id", 1], ["recipe_id", 1], ["created_at", "2021-08-11 00:45:56.607824"], ["updated_at", "2021-08-11 00:45:56.607824"]]

  def destroy
    recipe = Recipe.find(params[:recipe_id])
    favorite = current_member.favorites.find_by(recipe_id: recipe.id)
    favorite.destroy
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."member_id" = ? AND "favorites"."recipe_id" = ? LIMIT ?  [["member_id", 1], ["recipe_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]