app/controllers/public/homes_controller.rb

  def guest_sign_in
    member = Member.find_or_create_by!(email: 'guest@example.com') do |user|
---
INSERT INTO "members" ("email", "encrypted_password", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "members".* FROM "members" WHERE "members"."email" = ? LIMIT ?  [["email", "guest@example.com"], ["LIMIT", 1]]