app/controllers/public/members_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "members" SET "introduction" = ?, "image_id" = ?, "email" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["introduction", ""], ["image_id", nil], ["email", "guest@exacom"], ["updated_at", "2021-08-19 06:53:51.960335"], ["id", 4]]
---
  def update
    @member = Member.find(params[:id])
    if @member.update(member_params)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."member_id" = ?  [["member_id", 1]]
---
  def favorites
    @recipe = Recipe.find(params[:id])
    @favorites = Favorite.where(member_id: current_member.id)

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def correct_member
    @member = Member.find(params[:id])