app/controllers/public/members_controller.rb

  def show
    @member = Member.find(params[:id])
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."member_id" = ?  [["member_id", 2]]