app/controllers/public/members_controller.rb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."member_id" = ?  [["member_id", 1]]
---
  def favorites
    @favorites = Favorite.where(member_id: current_member.id)
    @favorites = Favorite.page(params[:page]).per(6)