app/controllers/public/products_controller.rb

SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"
---
  def index
    # @products = Product.all
    @products = Product.page(params[:page]).per(6)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."product_id" = ?  [["product_id", 1]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."product_id" = ?  [["product_id", 4]]
---
  def show
    @product = Product.find(params[:id])
    # @recipes = Recipe.all
    # 商品に紐付いたレシピを表示したい
    @recipes = @product.recipes.page(params[:page]).per(3)