app/controllers/public/recipes_controller.rb

INSERT INTO "recipes" ("member_id", "product_id", "name", "image_id", "introduction", "kodawari", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@recipe = current_member.recipes.new(recipe_params) レベル高い
    @recipe = Recipe.new(recipe_params)
    @recipe.product_id = params[:product_id]
    @recipe.member_id = current_member.id
    if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "image_id" = ?, "kodawari" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["image_id", "af929cae3e76cd5abf9ff51a1b8231e7c0e1b7e62e94511aec11741acd71"], ["kodawari", "テスト投稿編集チェックテスト"], ["updated_at", "2021-08-19 01:22:48.541963"], ["id", 1]]
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update(recipe_params)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def correct_member
      @recipe = Recipe.find(params[:id])