app/controllers/public/reviews_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]
---
  def index
    @recipe = Recipe.find(params[:recipe_id])
    @reviews = @recipe.reviews.page(params[:page]).per(5)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("member_id", "recipe_id", "comment", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["member_id", 1], ["recipe_id", 4], ["comment", "まぁまぁでした"], ["score", 4], ["created_at", "2021-08-19 06:06:33.843749"], ["updated_at", "2021-08-19 06:06:33.843749"]]
---
  def create
    @recipe = Recipe.find(params[:recipe_id])
    @review = Review.new(review_params)
    @review.recipe_id = params[:recipe_id]
    @review.member_id = current_member.id
    if @review.save