app/views/public/favorites/_favorite.html.erb

      <%= link_to product_recipe_favorites_path(recipe.product_id, recipe.id), method: :delete do %>
        <i class="fas fa-heart heart_red"></i><%= recipe.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."recipe_id" = ?  [["recipe_id", 1]]

      <%= link_to product_recipe_favorites_path(recipe.product_id, recipe.id), method: :post do %>
        <i class="fas fa-heart heart_blue"></i><%= recipe.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."recipe_id" = ?  [["recipe_id", 1]]