app/views/public/reviews/index.html.erb

              <div class="average-score-display ml-3 pt-2">
                <%= @recipe.avg_score %>点（<%= @recipe.reviews.count %>件のレビュー）
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]